In [1]:
people = {
    'first' : ['Corey', 'Jane', 'John'],
    'last' : ['Schafer', 'Doe', 'Doe'],
    'email' : ['Corey@gmail.com', 'Jane@gmail.com', 'John@gmail.com']
}

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame(people)

In [4]:
df

   first     last            email
0  Corey  Schafer  Corey@gmail.com
1   Jane      Doe   Jane@gmail.com
2   John      Doe   John@gmail.com

In [5]:
df['first'] + ' ' + df['last']

0    Corey Schafer
1         Jane Doe
2         John Doe
dtype: object

In [6]:
df['full_name'] = df['first'] + ' ' + df['last']
df

   first     last            email      full_name
0  Corey  Schafer  Corey@gmail.com  Corey Schafer
1   Jane      Doe   Jane@gmail.com       Jane Doe
2   John      Doe   John@gmail.com       John Doe

In [8]:
# you can also use the apply menthod
A = {'Input' : [1, 2, 3, 4]}
df_A = pd.DataFrame(A)

df_A['Squared'] = df_A['Input'].apply(lambda x : x ** 2)

df_A

   Input  Squared
0      1        1
1      2        4
2      3        9
3      4       16

In [10]:
# To remove the columns, we can use the drop method. This change is impermanent. If you want it to be permanent, place inplace = True
df.drop(columns = ['first', 'last'], inplace = True)

In [11]:
df

             email      full_name
0  Corey@gmail.com  Corey Schafer
1   Jane@gmail.com       Jane Doe
2   John@gmail.com       John Doe

In [15]:
# If we would to reverse the process, we use the string split method
# The result of the split method is that it gives the first and last name.
df['full_name'].str.split(' ')

# To expand, we have to specify that it is true.
# The results are similar, but now we have two columns.
df['full_name'].str.split(' ', expand = True)

       0        1
0  Corey  Schafer
1   Jane      Doe
2   John      Doe

In [17]:
# To put it into the dataframe, we pass in a list
df[['first', 'last']] = df['full_name'].str.split(' ' , expand = True)
df

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe

In [25]:
# To add rows of data, surprisingly append was deprecated and concat is now used instead
people = {
    'first' : ['Tony', 'Steve'],
    'last' : ['Stark', 'Rogers'],
    'email' : ['Tony@gmail.com', 'Steve@gmail.com']
}

df2 = pd.DataFrame(people)

In [29]:
# To add df2 to df, use concat. However, it is not permanent, so you have to choose which one to update
pd.concat([df, df2], ignore_index = True)

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe
3   Tony@gmail.com            NaN   Tony    Stark
4  Steve@gmail.com            NaN  Steve   Rogers

In [35]:
df = pd.concat([df, df2], ignore_index = True)

In [36]:
df

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe
3   Tony@gmail.com            NaN   Tony    Stark
4  Steve@gmail.com            NaN  Steve   Rogers

In [38]:
# To remove rows. This is not permanent
df.drop(4)

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe
3   Tony@gmail.com            NaN   Tony    Stark

In [39]:
df

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe
3   Tony@gmail.com            NaN   Tony    Stark
4  Steve@gmail.com            NaN  Steve   Rogers

In [40]:
df.drop(4, inplace = True)

In [41]:
df

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
1   Jane@gmail.com       Jane Doe   Jane      Doe
2   John@gmail.com       John Doe   John      Doe
3   Tony@gmail.com            NaN   Tony    Stark

In [42]:
# If you want to do a conditional
df.drop(index = df[df['last'] == 'Doe'].index)

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
3   Tony@gmail.com            NaN   Tony    Stark

In [43]:
# However, the code above is hard to read. So let us pull the conditonal out
filt = df['last'] == 'Doe'
df.drop(index = df[filt].index)

             email      full_name  first     last
0  Corey@gmail.com  Corey Schafer  Corey  Schafer
3   Tony@gmail.com            NaN   Tony    Stark